<?php

declare(strict_types=1);

return [
    400 => '您的请求存在问题。',

    401 => '您无权执行此操作。',

    403 => '禁止访问该内容。',

    404 => '找不到请求的页面。',

    405 => '用于该内容的HTTP方法不允许。',

    406 => '您尝试接收的内容在请求的格式中不可用。',

    409 => '处理您的请求时发生冲突。',

    410 => '请求的资源不再可用。',

    411 => '需要长度。',

    412 => '先决条件失败。',

    428 => '此请求需要先决条件。',

    422 => '输入数据存在问题。',

    423 => '资源被锁定。',

    429 => '您在短时间内进行了太多请求。',

    415 => '不支持该媒体类型。',

    500 => '发生内部服务器错误。',

    501 => '请求的功能尚未实现。',

    503 => '该服务暂时不可用。',
];
